autoscaling/loadtest/results/04-콘텐츠폭주/2026-08-23-t2b-300vu-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: autoscaling/loadtest/b-content-spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 6m30s max duration (incl. graceful stop):
              * default: Up to 300 looping VUs for 6m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/300 VUs, 7 complete and 0 interrupted iterations
default   [   0% ] 002/300 VUs  0m00.8s/6m00.0s

running (0m02.0s), 003/300 VUs, 29 complete and 0 interrupted iterations
default   [   0% ] 003/300 VUs  0m01.8s/6m00.0s

running (0m03.0s), 005/300 VUs, 67 complete and 0 interrupted iterations
default   [   1% ] 005/300 VUs  0m02.8s/6m00.0s

running (0m04.0s), 007/300 VUs, 117 complete and 0 interrupted iterations
default   [   1% ] 007/300 VUs  0m03.8s/6m00.0s

running (0m05.0s), 008/300 VUs, 172 complete and 0 interrupted iterations
default   [   1% ] 008/300 VUs  0m04.8s/6m00.0s

running (0m06.0s), 010/300 VUs, 233 complete and 0 interrupted iterations
default   [   2% ] 010/300 VUs  0m05.8s/6m00.0s

running (0m07.0s), 012/300 VUs, 299 complete and 0 interrupted iterations
default   [   2% ] 012/300 VUs  0m06.8s/6m00.0s

running (0m08.0s), 013/300 VUs, 399 complete and 0 interrupted iterations
default   [   2% ] 013/300 VUs  0m07.8s/6m00.0s

running (0m09.0s), 015/300 VUs, 510 complete and 0 interrupted iterations
default   [   2% ] 015/300 VUs  0m08.8s/6m00.0s

running (0m10.0s), 017/300 VUs, 630 complete and 0 interrupted iterations
default   [   3% ] 017/300 VUs  0m09.8s/6m00.0s

running (0m11.0s), 018/300 VUs, 756 complete and 0 interrupted iterations
default   [   3% ] 018/300 VUs  0m10.8s/6m00.0s

running (0m12.0s), 020/300 VUs, 868 complete and 0 interrupted iterations
default   [   3% ] 020/300 VUs  0m11.8s/6m00.0s

running (0m13.0s), 022/300 VUs, 974 complete and 0 interrupted iterations
default   [   4% ] 022/300 VUs  0m12.8s/6m00.0s

running (0m14.0s), 023/300 VUs, 1073 complete and 0 interrupted iterations
default   [   4% ] 023/300 VUs  0m13.8s/6m00.0s

running (0m15.0s), 025/300 VUs, 1192 complete and 0 interrupted iterations
default   [   4% ] 025/300 VUs  0m14.8s/6m00.0s

running (0m16.0s), 027/300 VUs, 1302 complete and 0 interrupted iterations
default   [   4% ] 027/300 VUs  0m15.8s/6m00.0s

running (0m17.0s), 028/300 VUs, 1399 complete and 0 interrupted iterations
default   [   5% ] 028/300 VUs  0m16.8s/6m00.0s

running (0m18.0s), 030/300 VUs, 1537 complete and 0 interrupted iterations
default   [   5% ] 030/300 VUs  0m17.8s/6m00.0s

running (0m19.0s), 031/300 VUs, 1677 complete and 0 interrupted iterations
default   [   5% ] 031/300 VUs  0m18.8s/6m00.0s

running (0m20.0s), 033/300 VUs, 1807 complete and 0 interrupted iterations
default   [   5% ] 033/300 VUs  0m19.8s/6m00.0s

running (0m21.0s), 035/300 VUs, 1944 complete and 0 interrupted iterations
default   [   6% ] 035/300 VUs  0m20.8s/6m00.0s

running (0m22.0s), 036/300 VUs, 2077 complete and 0 interrupted iterations
default   [   6% ] 036/300 VUs  0m21.8s/6m00.0s

running (0m23.0s), 038/300 VUs, 2221 complete and 0 interrupted iterations
default   [   6% ] 038/300 VUs  0m22.8s/6m00.0s

running (0m24.0s), 040/300 VUs, 2355 complete and 0 interrupted iterations
default   [   7% ] 040/300 VUs  0m23.8s/6m00.0s

running (0m25.0s), 041/300 VUs, 2491 complete and 0 interrupted iterations
default   [   7% ] 041/300 VUs  0m24.8s/6m00.0s

running (0m26.0s), 043/300 VUs, 2599 complete and 0 interrupted iterations
default   [   7% ] 043/300 VUs  0m25.8s/6m00.0s

running (0m27.0s), 045/300 VUs, 2710 complete and 0 interrupted iterations
default   [   7% ] 045/300 VUs  0m26.8s/6m00.0s

running (0m28.0s), 046/300 VUs, 2811 complete and 0 interrupted iterations
default   [   8% ] 046/300 VUs  0m27.8s/6m00.0s

running (0m29.0s), 048/300 VUs, 2904 complete and 0 interrupted iterations
default   [   8% ] 048/300 VUs  0m28.8s/6m00.0s

running (0m30.0s), 050/300 VUs, 3037 complete and 0 interrupted iterations
default   [   8% ] 050/300 VUs  0m29.8s/6m00.0s

running (0m31.0s), 051/300 VUs, 3184 complete and 0 interrupted iterations
default   [   9% ] 051/300 VUs  0m30.8s/6m00.0s

running (0m32.0s), 053/300 VUs, 3327 complete and 0 interrupted iterations
default   [   9% ] 053/300 VUs  0m31.8s/6m00.0s

running (0m33.0s), 055/300 VUs, 3466 complete and 0 interrupted iterations
default   [   9% ] 055/300 VUs  0m32.8s/6m00.0s

running (0m34.0s), 056/300 VUs, 3604 complete and 0 interrupted iterations
default   [   9% ] 056/300 VUs  0m33.8s/6m00.0s

running (0m35.0s), 058/300 VUs, 3755 complete and 0 interrupted iterations
default   [  10% ] 058/300 VUs  0m34.8s/6m00.0s

running (0m36.0s), 060/300 VUs, 3914 complete and 0 interrupted iterations
default   [  10% ] 060/300 VUs  0m35.8s/6m00.0s

running (0m37.0s), 061/300 VUs, 4073 complete and 0 interrupted iterations
default   [  10% ] 061/300 VUs  0m36.8s/6m00.0s

running (0m38.0s), 063/300 VUs, 4220 complete and 0 interrupted iterations
default   [  10% ] 063/300 VUs  0m37.8s/6m00.0s

running (0m39.0s), 064/300 VUs, 4350 complete and 0 interrupted iterations
default   [  11% ] 064/300 VUs  0m38.8s/6m00.0s

running (0m40.0s), 066/300 VUs, 4473 complete and 0 interrupted iterations
default   [  11% ] 066/300 VUs  0m39.8s/6m00.0s

running (0m41.0s), 068/300 VUs, 4614 complete and 0 interrupted iterations
default   [  11% ] 068/300 VUs  0m40.8s/6m00.0s

running (0m42.0s), 069/300 VUs, 4738 complete and 0 interrupted iterations
default   [  12% ] 069/300 VUs  0m41.8s/6m00.0s

running (0m43.0s), 071/300 VUs, 4866 complete and 0 interrupted iterations
default   [  12% ] 071/300 VUs  0m42.8s/6m00.0s

running (0m44.0s), 073/300 VUs, 5020 complete and 0 interrupted iterations
default   [  12% ] 073/300 VUs  0m43.8s/6m00.0s

running (0m45.0s), 074/300 VUs, 5173 complete and 0 interrupted iterations
default   [  12% ] 074/300 VUs  0m44.8s/6m00.0s

running (0m46.0s), 076/300 VUs, 5326 complete and 0 interrupted iterations
default   [  13% ] 076/300 VUs  0m45.8s/6m00.0s

running (0m47.0s), 078/300 VUs, 5478 complete and 0 interrupted iterations
default   [  13% ] 078/300 VUs  0m46.8s/6m00.0s

running (0m48.0s), 079/300 VUs, 5629 complete and 0 interrupted iterations
default   [  13% ] 079/300 VUs  0m47.8s/6m00.0s

running (0m49.0s), 081/300 VUs, 5772 complete and 0 interrupted iterations
default   [  14% ] 081/300 VUs  0m48.8s/6m00.0s

running (0m50.0s), 083/300 VUs, 5929 complete and 0 interrupted iterations
default   [  14% ] 083/300 VUs  0m49.8s/6m00.0s

running (0m51.0s), 084/300 VUs, 6076 complete and 0 interrupted iterations
default   [  14% ] 084/300 VUs  0m50.8s/6m00.0s

running (0m52.0s), 086/300 VUs, 6218 complete and 0 interrupted iterations
default   [  14% ] 086/300 VUs  0m51.8s/6m00.0s

running (0m53.0s), 088/300 VUs, 6327 complete and 0 interrupted iterations
default   [  15% ] 088/300 VUs  0m52.8s/6m00.0s

running (0m54.0s), 089/300 VUs, 6444 complete and 0 interrupted iterations
default   [  15% ] 089/300 VUs  0m53.8s/6m00.0s

running (0m55.0s), 091/300 VUs, 6546 complete and 0 interrupted iterations
default   [  15% ] 091/300 VUs  0m54.8s/6m00.0s

running (0m56.0s), 093/300 VUs, 6700 complete and 0 interrupted iterations
default   [  15% ] 093/300 VUs  0m55.8s/6m00.0s

running (0m57.0s), 094/300 VUs, 6841 complete and 0 interrupted iterations
default   [  16% ] 094/300 VUs  0m56.8s/6m00.0s

running (0m58.0s), 096/300 VUs, 6999 complete and 0 interrupted iterations
default   [  16% ] 096/300 VUs  0m57.8s/6m00.0s

running (0m59.0s), 097/300 VUs, 7152 complete and 0 interrupted iterations
default   [  16% ] 097/300 VUs  0m58.8s/6m00.0s

running (1m00.0s), 099/300 VUs, 7315 complete and 0 interrupted iterations
default   [  17% ] 099/300 VUs  0m59.8s/6m00.0s

running (1m01.0s), 101/300 VUs, 7468 complete and 0 interrupted iterations
default   [  17% ] 101/300 VUs  1m00.8s/6m00.0s

running (1m02.0s), 102/300 VUs, 7627 complete and 0 interrupted iterations
default   [  17% ] 102/300 VUs  1m01.8s/6m00.0s

running (1m03.0s), 104/300 VUs, 7785 complete and 0 interrupted iterations
default   [  17% ] 104/300 VUs  1m02.8s/6m00.0s

running (1m04.0s), 106/300 VUs, 7938 complete and 0 interrupted iterations
default   [  18% ] 106/300 VUs  1m03.8s/6m00.0s

running (1m05.0s), 107/300 VUs, 8073 complete and 0 interrupted iterations
default   [  18% ] 107/300 VUs  1m04.8s/6m00.0s

running (1m06.0s), 109/300 VUs, 8193 complete and 0 interrupted iterations
default   [  18% ] 109/300 VUs  1m05.8s/6m00.0s

running (1m07.0s), 111/300 VUs, 8262 complete and 0 interrupted iterations
default   [  19% ] 111/300 VUs  1m06.8s/6m00.0s

running (1m08.0s), 112/300 VUs, 8348 complete and 0 interrupted iterations
default   [  19% ] 112/300 VUs  1m07.8s/6m00.0s

running (1m09.0s), 114/300 VUs, 8467 complete and 0 interrupted iterations
default   [  19% ] 114/300 VUs  1m08.8s/6m00.0s

running (1m10.0s), 116/300 VUs, 8632 complete and 0 interrupted iterations
default   [  19% ] 116/300 VUs  1m09.8s/6m00.0s

running (1m11.0s), 117/300 VUs, 8786 complete and 0 interrupted iterations
default   [  20% ] 117/300 VUs  1m10.8s/6m00.0s

running (1m12.0s), 119/300 VUs, 8938 complete and 0 interrupted iterations
default   [  20% ] 119/300 VUs  1m11.8s/6m00.0s

running (1m13.0s), 121/300 VUs, 9081 complete and 0 interrupted iterations
default   [  20% ] 121/300 VUs  1m12.8s/6m00.0s

running (1m14.0s), 122/300 VUs, 9190 complete and 0 interrupted iterations
default   [  20% ] 122/300 VUs  1m13.8s/6m00.0s

running (1m15.0s), 124/300 VUs, 9324 complete and 0 interrupted iterations
default   [  21% ] 124/300 VUs  1m14.8s/6m00.0s

running (1m16.0s), 126/300 VUs, 9477 complete and 0 interrupted iterations
default   [  21% ] 126/300 VUs  1m15.8s/6m00.0s

running (1m17.0s), 127/300 VUs, 9590 complete and 0 interrupted iterations
default   [  21% ] 127/300 VUs  1m16.8s/6m00.0s

running (1m18.0s), 129/300 VUs, 9694 complete and 0 interrupted iterations
default   [  22% ] 129/300 VUs  1m17.8s/6m00.0s

running (1m19.0s), 131/300 VUs, 9795 complete and 0 interrupted iterations
default   [  22% ] 131/300 VUs  1m18.8s/6m00.0s

running (1m20.0s), 132/300 VUs, 9904 complete and 0 interrupted iterations
default   [  22% ] 132/300 VUs  1m19.8s/6m00.0s

running (1m21.0s), 134/300 VUs, 10029 complete and 0 interrupted iterations
default   [  22% ] 134/300 VUs  1m20.8s/6m00.0s

running (1m22.0s), 136/300 VUs, 10155 complete and 0 interrupted iterations
default   [  23% ] 136/300 VUs  1m21.8s/6m00.0s

running (1m23.0s), 137/300 VUs, 10313 complete and 0 interrupted iterations
default   [  23% ] 137/300 VUs  1m22.8s/6m00.0s

running (1m24.0s), 139/300 VUs, 10467 complete and 0 interrupted iterations
default   [  23% ] 139/300 VUs  1m23.8s/6m00.0s

running (1m25.0s), 141/300 VUs, 10633 complete and 0 interrupted iterations
default   [  24% ] 141/300 VUs  1m24.8s/6m00.0s

running (1m26.0s), 142/300 VUs, 10778 complete and 0 interrupted iterations
default   [  24% ] 142/300 VUs  1m25.8s/6m00.0s

running (1m27.0s), 144/300 VUs, 10942 complete and 0 interrupted iterations
default   [  24% ] 144/300 VUs  1m26.8s/6m00.0s

running (1m28.0s), 146/300 VUs, 11086 complete and 0 interrupted iterations
default   [  24% ] 146/300 VUs  1m27.8s/6m00.0s

running (1m29.0s), 147/300 VUs, 11232 complete and 0 interrupted iterations
default   [  25% ] 147/300 VUs  1m28.8s/6m00.0s

running (1m30.0s), 149/300 VUs, 11349 complete and 0 interrupted iterations
default   [  25% ] 149/300 VUs  1m29.8s/6m00.0s

running (1m31.0s), 151/300 VUs, 11451 complete and 0 interrupted iterations
default   [  25% ] 151/300 VUs  1m30.8s/6m00.0s

running (1m32.0s), 152/300 VUs, 11574 complete and 0 interrupted iterations
default   [  25% ] 152/300 VUs  1m31.8s/6m00.0s

running (1m33.0s), 154/300 VUs, 11686 complete and 0 interrupted iterations
default   [  26% ] 154/300 VUs  1m32.8s/6m00.0s

running (1m34.0s), 156/300 VUs, 11795 complete and 0 interrupted iterations
default   [  26% ] 156/300 VUs  1m33.8s/6m00.0s

running (1m35.0s), 157/300 VUs, 11938 complete and 0 interrupted iterations
default   [  26% ] 157/300 VUs  1m34.8s/6m00.0s

running (1m36.0s), 159/300 VUs, 12090 complete and 0 interrupted iterations
default   [  27% ] 159/300 VUs  1m35.8s/6m00.0s

running (1m37.0s), 161/300 VUs, 12246 complete and 0 interrupted iterations
default   [  27% ] 161/300 VUs  1m36.8s/6m00.0s

running (1m38.0s), 162/300 VUs, 12393 complete and 0 interrupted iterations
default   [  27% ] 162/300 VUs  1m37.8s/6m00.0s

running (1m39.0s), 164/300 VUs, 12550 complete and 0 interrupted iterations
default   [  27% ] 164/300 VUs  1m38.8s/6m00.0s

running (1m40.0s), 166/300 VUs, 12698 complete and 0 interrupted iterations
default   [  28% ] 166/300 VUs  1m39.8s/6m00.0s

running (1m41.0s), 167/300 VUs, 12851 complete and 0 interrupted iterations
default   [  28% ] 167/300 VUs  1m40.8s/6m00.0s

running (1m42.0s), 169/300 VUs, 13001 complete and 0 interrupted iterations
default   [  28% ] 169/300 VUs  1m41.8s/6m00.0s

running (1m43.0s), 171/300 VUs, 13133 complete and 0 interrupted iterations
default   [  29% ] 171/300 VUs  1m42.8s/6m00.0s

running (1m44.0s), 172/300 VUs, 13247 complete and 0 interrupted iterations
default   [  29% ] 172/300 VUs  1m43.8s/6m00.0s

running (1m45.0s), 174/300 VUs, 13383 complete and 0 interrupted iterations
default   [  29% ] 174/300 VUs  1m44.8s/6m00.0s

running (1m46.0s), 176/300 VUs, 13479 complete and 0 interrupted iterations
default   [  29% ] 176/300 VUs  1m45.8s/6m00.0s

running (1m47.0s), 177/300 VUs, 13604 complete and 0 interrupted iterations
default   [  30% ] 177/300 VUs  1m46.8s/6m00.0s

running (1m48.0s), 179/300 VUs, 13778 complete and 0 interrupted iterations
default   [  30% ] 179/300 VUs  1m47.8s/6m00.0s

running (1m49.0s), 181/300 VUs, 13929 complete and 0 interrupted iterations
default   [  30% ] 181/300 VUs  1m48.8s/6m00.0s

running (1m50.0s), 182/300 VUs, 14088 complete and 0 interrupted iterations
default   [  30% ] 182/300 VUs  1m49.8s/6m00.0s

running (1m51.0s), 184/300 VUs, 14242 complete and 0 interrupted iterations
default   [  31% ] 184/300 VUs  1m50.8s/6m00.0s

running (1m52.0s), 186/300 VUs, 14390 complete and 0 interrupted iterations
default   [  31% ] 186/300 VUs  1m51.8s/6m00.0s

running (1m53.0s), 187/300 VUs, 14539 complete and 0 interrupted iterations
default   [  31% ] 187/300 VUs  1m52.8s/6m00.0s

running (1m54.0s), 189/300 VUs, 14700 complete and 0 interrupted iterations
default   [  32% ] 189/300 VUs  1m53.8s/6m00.0s

running (1m55.0s), 191/300 VUs, 14849 complete and 0 interrupted iterations
default   [  32% ] 191/300 VUs  1m54.8s/6m00.0s

running (1m56.0s), 192/300 VUs, 14983 complete and 0 interrupted iterations
default   [  32% ] 192/300 VUs  1m55.8s/6m00.0s

running (1m57.0s), 194/300 VUs, 15105 complete and 0 interrupted iterations
default   [  32% ] 194/300 VUs  1m56.8s/6m00.0s

running (1m58.0s), 196/300 VUs, 15214 complete and 0 interrupted iterations
default   [  33% ] 196/300 VUs  1m57.8s/6m00.0s

running (1m59.0s), 197/300 VUs, 15340 complete and 0 interrupted iterations
default   [  33% ] 197/300 VUs  1m58.8s/6m00.0s

running (2m00.0s), 199/300 VUs, 15468 complete and 0 interrupted iterations
default   [  33% ] 199/300 VUs  1m59.8s/6m00.0s

running (2m01.0s), 201/300 VUs, 15636 complete and 0 interrupted iterations
default   [  34% ] 201/300 VUs  2m00.8s/6m00.0s

running (2m02.0s), 202/300 VUs, 15783 complete and 0 interrupted iterations
default   [  34% ] 202/300 VUs  2m01.8s/6m00.0s

running (2m03.0s), 204/300 VUs, 15934 complete and 0 interrupted iterations
default   [  34% ] 204/300 VUs  2m02.8s/6m00.0s

running (2m04.0s), 206/300 VUs, 16077 complete and 0 interrupted iterations
default   [  34% ] 206/300 VUs  2m03.8s/6m00.0s

running (2m05.0s), 207/300 VUs, 16204 complete and 0 interrupted iterations
default   [  35% ] 207/300 VUs  2m04.8s/6m00.0s

running (2m06.0s), 209/300 VUs, 16348 complete and 0 interrupted iterations
default   [  35% ] 209/300 VUs  2m05.8s/6m00.0s

running (2m07.0s), 211/300 VUs, 16477 complete and 0 interrupted iterations
default   [  35% ] 211/300 VUs  2m06.8s/6m00.0s

running (2m08.0s), 212/300 VUs, 16617 complete and 0 interrupted iterations
default   [  35% ] 212/300 VUs  2m07.8s/6m00.0s

running (2m09.0s), 214/300 VUs, 16748 complete and 0 interrupted iterations
default   [  36% ] 214/300 VUs  2m08.8s/6m00.0s

running (2m10.0s), 216/300 VUs, 16870 complete and 0 interrupted iterations
default   [  36% ] 216/300 VUs  2m09.8s/6m00.0s

running (2m11.0s), 217/300 VUs, 16972 complete and 0 interrupted iterations
default   [  36% ] 217/300 VUs  2m10.8s/6m00.0s

running (2m12.0s), 219/300 VUs, 17039 complete and 0 interrupted iterations
default   [  37% ] 219/300 VUs  2m11.8s/6m00.0s

running (2m13.0s), 221/300 VUs, 17161 complete and 0 interrupted iterations
default   [  37% ] 221/300 VUs  2m12.8s/6m00.0s

running (2m14.0s), 222/300 VUs, 17327 complete and 0 interrupted iterations
default   [  37% ] 222/300 VUs  2m13.8s/6m00.0s

running (2m15.0s), 224/300 VUs, 17476 complete and 0 interrupted iterations
default   [  37% ] 224/300 VUs  2m14.8s/6m00.0s

running (2m16.0s), 226/300 VUs, 17635 complete and 0 interrupted iterations
default   [  38% ] 226/300 VUs  2m15.8s/6m00.0s

running (2m17.0s), 227/300 VUs, 17793 complete and 0 interrupted iterations
default   [  38% ] 227/300 VUs  2m16.8s/6m00.0s

running (2m18.0s), 229/300 VUs, 17941 complete and 0 interrupted iterations
default   [  38% ] 229/300 VUs  2m17.8s/6m00.0s

running (2m19.0s), 231/300 VUs, 18091 complete and 0 interrupted iterations
default   [  39% ] 231/300 VUs  2m18.8s/6m00.0s

running (2m20.0s), 232/300 VUs, 18258 complete and 0 interrupted iterations
default   [  39% ] 232/300 VUs  2m19.8s/6m00.0s

running (2m21.0s), 234/300 VUs, 18414 complete and 0 interrupted iterations
default   [  39% ] 234/300 VUs  2m20.8s/6m00.0s

running (2m22.0s), 236/300 VUs, 18543 complete and 0 interrupted iterations
default   [  39% ] 236/300 VUs  2m21.8s/6m00.0s

running (2m23.0s), 237/300 VUs, 18663 complete and 0 interrupted iterations
default   [  40% ] 237/300 VUs  2m22.8s/6m00.0s

running (2m24.0s), 239/300 VUs, 18760 complete and 0 interrupted iterations
default   [  40% ] 239/300 VUs  2m23.8s/6m00.0s

running (2m25.0s), 241/300 VUs, 18864 complete and 0 interrupted iterations
default   [  40% ] 241/300 VUs  2m24.8s/6m00.0s

running (2m26.0s), 242/300 VUs, 18986 complete and 0 interrupted iterations
default   [  40% ] 242/300 VUs  2m25.8s/6m00.0s

running (2m27.0s), 244/300 VUs, 19146 complete and 0 interrupted iterations
default   [  41% ] 244/300 VUs  2m26.8s/6m00.0s

running (2m28.0s), 246/300 VUs, 19295 complete and 0 interrupted iterations
default   [  41% ] 246/300 VUs  2m27.8s/6m00.0s

running (2m29.0s), 247/300 VUs, 19447 complete and 0 interrupted iterations
default   [  41% ] 247/300 VUs  2m28.8s/6m00.0s

running (2m30.0s), 249/300 VUs, 19595 complete and 0 interrupted iterations
default   [  42% ] 249/300 VUs  2m29.8s/6m00.0s

running (2m31.0s), 251/300 VUs, 19755 complete and 0 interrupted iterations
default   [  42% ] 251/300 VUs  2m30.8s/6m00.0s

running (2m32.0s), 252/300 VUs, 19903 complete and 0 interrupted iterations
default   [  42% ] 252/300 VUs  2m31.8s/6m00.0s

running (2m33.0s), 254/300 VUs, 20058 complete and 0 interrupted iterations
default   [  42% ] 254/300 VUs  2m32.8s/6m00.0s

running (2m34.0s), 256/300 VUs, 20204 complete and 0 interrupted iterations
default   [  43% ] 256/300 VUs  2m33.8s/6m00.0s

running (2m35.0s), 257/300 VUs, 20327 complete and 0 interrupted iterations
default   [  43% ] 257/300 VUs  2m34.8s/6m00.0s

running (2m36.0s), 259/300 VUs, 20425 complete and 0 interrupted iterations
default   [  43% ] 259/300 VUs  2m35.8s/6m00.0s

running (2m37.0s), 261/300 VUs, 20547 complete and 0 interrupted iterations
default   [  44% ] 261/300 VUs  2m36.8s/6m00.0s

running (2m38.0s), 262/300 VUs, 20672 complete and 0 interrupted iterations
default   [  44% ] 262/300 VUs  2m37.8s/6m00.0s

running (2m39.0s), 264/300 VUs, 20807 complete and 0 interrupted iterations
default   [  44% ] 264/300 VUs  2m38.8s/6m00.0s

running (2m40.0s), 266/300 VUs, 20975 complete and 0 interrupted iterations
default   [  44% ] 266/300 VUs  2m39.8s/6m00.0s

running (2m41.0s), 267/300 VUs, 21112 complete and 0 interrupted iterations
default   [  45% ] 267/300 VUs  2m40.8s/6m00.0s

running (2m42.0s), 269/300 VUs, 21271 complete and 0 interrupted iterations
default   [  45% ] 269/300 VUs  2m41.8s/6m00.0s

running (2m43.0s), 271/300 VUs, 21429 complete and 0 interrupted iterations
default   [  45% ] 271/300 VUs  2m42.8s/6m00.0s

running (2m44.0s), 272/300 VUs, 21583 complete and 0 interrupted iterations
default   [  45% ] 272/300 VUs  2m43.8s/6m00.0s

running (2m45.0s), 274/300 VUs, 21733 complete and 0 interrupted iterations
default   [  46% ] 274/300 VUs  2m44.8s/6m00.0s

running (2m46.0s), 276/300 VUs, 21864 complete and 0 interrupted iterations
default   [  46% ] 276/300 VUs  2m45.8s/6m00.0s

running (2m47.0s), 277/300 VUs, 22003 complete and 0 interrupted iterations
default   [  46% ] 277/300 VUs  2m46.8s/6m00.0s

running (2m48.0s), 279/300 VUs, 22116 complete and 0 interrupted iterations
default   [  47% ] 279/300 VUs  2m47.8s/6m00.0s

running (2m49.0s), 281/300 VUs, 22232 complete and 0 interrupted iterations
default   [  47% ] 281/300 VUs  2m48.8s/6m00.0s

running (2m50.0s), 282/300 VUs, 22342 complete and 0 interrupted iterations
default   [  47% ] 282/300 VUs  2m49.8s/6m00.0s

running (2m51.0s), 284/300 VUs, 22457 complete and 0 interrupted iterations
default   [  47% ] 284/300 VUs  2m50.8s/6m00.0s

running (2m52.0s), 286/300 VUs, 22607 complete and 0 interrupted iterations
default   [  48% ] 286/300 VUs  2m51.8s/6m00.0s

running (2m53.0s), 287/300 VUs, 22760 complete and 0 interrupted iterations
default   [  48% ] 287/300 VUs  2m52.8s/6m00.0s

running (2m54.0s), 289/300 VUs, 22905 complete and 0 interrupted iterations
default   [  48% ] 289/300 VUs  2m53.8s/6m00.0s

running (2m55.0s), 291/300 VUs, 23054 complete and 0 interrupted iterations
default   [  49% ] 291/300 VUs  2m54.8s/6m00.0s

running (2m56.0s), 292/300 VUs, 23219 complete and 0 interrupted iterations
default   [  49% ] 292/300 VUs  2m55.8s/6m00.0s

running (2m57.0s), 294/300 VUs, 23355 complete and 0 interrupted iterations
default   [  49% ] 294/300 VUs  2m56.8s/6m00.0s

running (2m58.0s), 296/300 VUs, 23501 complete and 0 interrupted iterations
default   [  49% ] 296/300 VUs  2m57.8s/6m00.0s

running (2m59.0s), 297/300 VUs, 23670 complete and 0 interrupted iterations
default   [  50% ] 297/300 VUs  2m58.8s/6m00.0s

running (3m00.0s), 299/300 VUs, 23813 complete and 0 interrupted iterations
default   [  50% ] 299/300 VUs  2m59.8s/6m00.0s

running (3m01.0s), 300/300 VUs, 23921 complete and 0 interrupted iterations
default   [  50% ] 300/300 VUs  3m00.8s/6m00.0s

running (3m02.0s), 300/300 VUs, 24028 complete and 0 interrupted iterations
default   [  50% ] 300/300 VUs  3m01.8s/6m00.0s

running (3m03.0s), 300/300 VUs, 24165 complete and 0 interrupted iterations
default   [  51% ] 300/300 VUs  3m02.8s/6m00.0s

running (3m04.0s), 300/300 VUs, 24291 complete and 0 interrupted iterations
default   [  51% ] 300/300 VUs  3m03.8s/6m00.0s

running (3m05.0s), 300/300 VUs, 24426 complete and 0 interrupted iterations
default   [  51% ] 300/300 VUs  3m04.8s/6m00.0s

running (3m06.0s), 300/300 VUs, 24576 complete and 0 interrupted iterations
default   [  52% ] 300/300 VUs  3m05.8s/6m00.0s

running (3m07.0s), 300/300 VUs, 24664 complete and 0 interrupted iterations
default   [  52% ] 300/300 VUs  3m06.8s/6m00.0s

running (3m08.0s), 300/300 VUs, 24765 complete and 0 interrupted iterations
default   [  52% ] 300/300 VUs  3m07.8s/6m00.0s

running (3m09.0s), 300/300 VUs, 24885 complete and 0 interrupted iterations
default   [  52% ] 300/300 VUs  3m08.8s/6m00.0s

running (3m10.0s), 300/300 VUs, 25013 complete and 0 interrupted iterations
default   [  53% ] 300/300 VUs  3m09.8s/6m00.0s

running (3m11.0s), 300/300 VUs, 25144 complete and 0 interrupted iterations
default   [  53% ] 300/300 VUs  3m10.8s/6m00.0s

running (3m12.0s), 300/300 VUs, 25290 complete and 0 interrupted iterations
default   [  53% ] 300/300 VUs  3m11.8s/6m00.0s

running (3m13.0s), 300/300 VUs, 25423 complete and 0 interrupted iterations
default   [  54% ] 300/300 VUs  3m12.8s/6m00.0s

running (3m14.0s), 300/300 VUs, 25547 complete and 0 interrupted iterations
default   [  54% ] 300/300 VUs  3m13.8s/6m00.0s

running (3m15.0s), 300/300 VUs, 25654 complete and 0 interrupted iterations
default   [  54% ] 300/300 VUs  3m14.8s/6m00.0s

running (3m16.0s), 300/300 VUs, 25734 complete and 0 interrupted iterations
default   [  54% ] 300/300 VUs  3m15.8s/6m00.0s

running (3m17.0s), 300/300 VUs, 25841 complete and 0 interrupted iterations
default   [  55% ] 300/300 VUs  3m16.8s/6m00.0s

running (3m18.0s), 300/300 VUs, 26009 complete and 0 interrupted iterations
default   [  55% ] 300/300 VUs  3m17.8s/6m00.0s

running (3m19.0s), 300/300 VUs, 26172 complete and 0 interrupted iterations
default   [  55% ] 300/300 VUs  3m18.8s/6m00.0s

running (3m20.0s), 300/300 VUs, 26308 complete and 0 interrupted iterations
default   [  55% ] 300/300 VUs  3m19.8s/6m00.0s

running (3m21.0s), 300/300 VUs, 26446 complete and 0 interrupted iterations
default   [  56% ] 300/300 VUs  3m20.8s/6m00.0s

running (3m22.0s), 300/300 VUs, 26599 complete and 0 interrupted iterations
default   [  56% ] 300/300 VUs  3m21.8s/6m00.0s

running (3m23.0s), 300/300 VUs, 26756 complete and 0 interrupted iterations
default   [  56% ] 300/300 VUs  3m22.8s/6m00.0s

running (3m24.0s), 300/300 VUs, 26914 complete and 0 interrupted iterations
default   [  57% ] 300/300 VUs  3m23.8s/6m00.0s

running (3m25.0s), 300/300 VUs, 27058 complete and 0 interrupted iterations
default   [  57% ] 300/300 VUs  3m24.8s/6m00.0s

running (3m26.0s), 300/300 VUs, 27184 complete and 0 interrupted iterations
default   [  57% ] 300/300 VUs  3m25.8s/6m00.0s

running (3m27.0s), 300/300 VUs, 27286 complete and 0 interrupted iterations
default   [  57% ] 300/300 VUs  3m26.8s/6m00.0s

running (3m28.0s), 300/300 VUs, 27386 complete and 0 interrupted iterations
default   [  58% ] 300/300 VUs  3m27.8s/6m00.0s

running (3m29.0s), 300/300 VUs, 27488 complete and 0 interrupted iterations
default   [  58% ] 300/300 VUs  3m28.8s/6m00.0s

running (3m30.0s), 300/300 VUs, 27605 complete and 0 interrupted iterations
default   [  58% ] 300/300 VUs  3m29.8s/6m00.0s

running (3m31.0s), 300/300 VUs, 27772 complete and 0 interrupted iterations
default   [  59% ] 300/300 VUs  3m30.8s/6m00.0s

running (3m32.0s), 300/300 VUs, 27935 complete and 0 interrupted iterations
default   [  59% ] 300/300 VUs  3m31.8s/6m00.0s

running (3m33.0s), 300/300 VUs, 28089 complete and 0 interrupted iterations
default   [  59% ] 300/300 VUs  3m32.8s/6m00.0s

running (3m34.0s), 300/300 VUs, 28239 complete and 0 interrupted iterations
default   [  59% ] 300/300 VUs  3m33.8s/6m00.0s

running (3m35.0s), 300/300 VUs, 28389 complete and 0 interrupted iterations
default   [  60% ] 300/300 VUs  3m34.8s/6m00.0s

running (3m36.0s), 300/300 VUs, 28525 complete and 0 interrupted iterations
default   [  60% ] 300/300 VUs  3m35.8s/6m00.0s

running (3m37.0s), 300/300 VUs, 28672 complete and 0 interrupted iterations
default   [  60% ] 300/300 VUs  3m36.8s/6m00.0s

running (3m38.0s), 300/300 VUs, 28823 complete and 0 interrupted iterations
default   [  60% ] 300/300 VUs  3m37.8s/6m00.0s

running (3m39.0s), 300/300 VUs, 28947 complete and 0 interrupted iterations
default   [  61% ] 300/300 VUs  3m38.8s/6m00.0s

running (3m40.0s), 300/300 VUs, 29062 complete and 0 interrupted iterations
default   [  61% ] 300/300 VUs  3m39.8s/6m00.0s

running (3m41.0s), 300/300 VUs, 29183 complete and 0 interrupted iterations
default   [  61% ] 300/300 VUs  3m40.8s/6m00.0s

running (3m42.0s), 300/300 VUs, 29285 complete and 0 interrupted iterations
default   [  62% ] 300/300 VUs  3m41.8s/6m00.0s

running (3m43.0s), 300/300 VUs, 29404 complete and 0 interrupted iterations
default   [  62% ] 300/300 VUs  3m42.8s/6m00.0s

running (3m44.0s), 300/300 VUs, 29558 complete and 0 interrupted iterations
default   [  62% ] 300/300 VUs  3m43.8s/6m00.0s

running (3m45.0s), 300/300 VUs, 29710 complete and 0 interrupted iterations
default   [  62% ] 300/300 VUs  3m44.8s/6m00.0s

running (3m46.0s), 300/300 VUs, 29862 complete and 0 interrupted iterations
default   [  63% ] 300/300 VUs  3m45.8s/6m00.0s

running (3m47.0s), 300/300 VUs, 30015 complete and 0 interrupted iterations
default   [  63% ] 300/300 VUs  3m46.8s/6m00.0s

running (3m48.0s), 300/300 VUs, 30176 complete and 0 interrupted iterations
default   [  63% ] 300/300 VUs  3m47.8s/6m00.0s

running (3m49.0s), 300/300 VUs, 30332 complete and 0 interrupted iterations
default   [  64% ] 300/300 VUs  3m48.8s/6m00.0s

running (3m50.0s), 300/300 VUs, 30449 complete and 0 interrupted iterations
default   [  64% ] 300/300 VUs  3m49.8s/6m00.0s

running (3m51.0s), 300/300 VUs, 30597 complete and 0 interrupted iterations
default   [  64% ] 300/300 VUs  3m50.8s/6m00.0s

running (3m52.0s), 300/300 VUs, 30722 complete and 0 interrupted iterations
default   [  64% ] 300/300 VUs  3m51.8s/6m00.0s

running (3m53.0s), 300/300 VUs, 30820 complete and 0 interrupted iterations
default   [  65% ] 300/300 VUs  3m52.8s/6m00.0s

running (3m54.0s), 300/300 VUs, 30929 complete and 0 interrupted iterations
default   [  65% ] 300/300 VUs  3m53.8s/6m00.0s

running (3m55.0s), 300/300 VUs, 31034 complete and 0 interrupted iterations
default   [  65% ] 300/300 VUs  3m54.8s/6m00.0s

running (3m56.0s), 300/300 VUs, 31196 complete and 0 interrupted iterations
default   [  65% ] 300/300 VUs  3m55.8s/6m00.0s

running (3m57.0s), 300/300 VUs, 31343 complete and 0 interrupted iterations
default   [  66% ] 300/300 VUs  3m56.8s/6m00.0s

running (3m58.0s), 300/300 VUs, 31492 complete and 0 interrupted iterations
default   [  66% ] 300/300 VUs  3m57.8s/6m00.0s

running (3m59.0s), 300/300 VUs, 31653 complete and 0 interrupted iterations
default   [  66% ] 300/300 VUs  3m58.8s/6m00.0s

running (4m00.0s), 300/300 VUs, 31803 complete and 0 interrupted iterations
default   [  67% ] 300/300 VUs  3m59.8s/6m00.0s

running (4m01.0s), 300/300 VUs, 31952 complete and 0 interrupted iterations
default   [  67% ] 300/300 VUs  4m00.8s/6m00.0s

running (4m02.0s), 300/300 VUs, 32088 complete and 0 interrupted iterations
default   [  67% ] 300/300 VUs  4m01.8s/6m00.0s

running (4m03.0s), 300/300 VUs, 32231 complete and 0 interrupted iterations
default   [  67% ] 300/300 VUs  4m02.8s/6m00.0s

running (4m04.0s), 300/300 VUs, 32375 complete and 0 interrupted iterations
default   [  68% ] 300/300 VUs  4m03.8s/6m00.0s

running (4m05.0s), 300/300 VUs, 32432 complete and 0 interrupted iterations
default   [  68% ] 300/300 VUs  4m04.8s/6m00.0s

running (4m06.0s), 300/300 VUs, 32540 complete and 0 interrupted iterations
default   [  68% ] 300/300 VUs  4m05.8s/6m00.0s

running (4m07.0s), 300/300 VUs, 32596 complete and 0 interrupted iterations
default   [  69% ] 300/300 VUs  4m06.8s/6m00.0s

running (4m08.0s), 300/300 VUs, 32720 complete and 0 interrupted iterations
default   [  69% ] 300/300 VUs  4m07.8s/6m00.0s

running (4m09.0s), 300/300 VUs, 32844 complete and 0 interrupted iterations
default   [  69% ] 300/300 VUs  4m08.8s/6m00.0s

running (4m10.0s), 300/300 VUs, 32994 complete and 0 interrupted iterations
default   [  69% ] 300/300 VUs  4m09.8s/6m00.0s

running (4m11.0s), 300/300 VUs, 33132 complete and 0 interrupted iterations
default   [  70% ] 300/300 VUs  4m10.8s/6m00.0s

running (4m12.0s), 300/300 VUs, 33262 complete and 0 interrupted iterations
default   [  70% ] 300/300 VUs  4m11.8s/6m00.0s

running (4m13.0s), 300/300 VUs, 33395 complete and 0 interrupted iterations
default   [  70% ] 300/300 VUs  4m12.8s/6m00.0s

running (4m14.0s), 300/300 VUs, 33532 complete and 0 interrupted iterations
default   [  70% ] 300/300 VUs  4m13.8s/6m00.0s

running (4m15.0s), 300/300 VUs, 33654 complete and 0 interrupted iterations
default   [  71% ] 300/300 VUs  4m14.8s/6m00.0s

running (4m16.0s), 300/300 VUs, 33813 complete and 0 interrupted iterations
default   [  71% ] 300/300 VUs  4m15.8s/6m00.0s

running (4m17.0s), 300/300 VUs, 33945 complete and 0 interrupted iterations
default   [  71% ] 300/300 VUs  4m16.8s/6m00.0s

running (4m18.0s), 300/300 VUs, 34055 complete and 0 interrupted iterations
default   [  72% ] 300/300 VUs  4m17.8s/6m00.0s

running (4m19.0s), 300/300 VUs, 34161 complete and 0 interrupted iterations
default   [  72% ] 300/300 VUs  4m18.8s/6m00.0s

running (4m20.0s), 300/300 VUs, 34271 complete and 0 interrupted iterations
default   [  72% ] 300/300 VUs  4m19.8s/6m00.0s

running (4m21.0s), 300/300 VUs, 34427 complete and 0 interrupted iterations
default   [  72% ] 300/300 VUs  4m20.8s/6m00.0s

running (4m22.0s), 300/300 VUs, 34543 complete and 0 interrupted iterations
default   [  73% ] 300/300 VUs  4m21.8s/6m00.0s

running (4m23.0s), 300/300 VUs, 34677 complete and 0 interrupted iterations
default   [  73% ] 300/300 VUs  4m22.8s/6m00.0s

running (4m24.0s), 300/300 VUs, 34826 complete and 0 interrupted iterations
default   [  73% ] 300/300 VUs  4m23.8s/6m00.0s

running (4m25.0s), 300/300 VUs, 34981 complete and 0 interrupted iterations
default   [  74% ] 300/300 VUs  4m24.8s/6m00.0s

running (4m26.0s), 300/300 VUs, 35147 complete and 0 interrupted iterations
default   [  74% ] 300/300 VUs  4m25.8s/6m00.0s

running (4m27.0s), 300/300 VUs, 35296 complete and 0 interrupted iterations
default   [  74% ] 300/300 VUs  4m26.8s/6m00.0s

running (4m28.0s), 300/300 VUs, 35445 complete and 0 interrupted iterations
default   [  74% ] 300/300 VUs  4m27.8s/6m00.0s

running (4m29.0s), 300/300 VUs, 35597 complete and 0 interrupted iterations
default   [  75% ] 300/300 VUs  4m28.8s/6m00.0s

running (4m30.0s), 300/300 VUs, 35718 complete and 0 interrupted iterations
default   [  75% ] 300/300 VUs  4m29.8s/6m00.0s

running (4m31.0s), 300/300 VUs, 35862 complete and 0 interrupted iterations
default   [  75% ] 300/300 VUs  4m30.8s/6m00.0s

running (4m32.0s), 300/300 VUs, 35966 complete and 0 interrupted iterations
default   [  75% ] 300/300 VUs  4m31.8s/6m00.0s

running (4m33.0s), 300/300 VUs, 36057 complete and 0 interrupted iterations
default   [  76% ] 300/300 VUs  4m32.8s/6m00.0s

running (4m34.0s), 300/300 VUs, 36174 complete and 0 interrupted iterations
default   [  76% ] 300/300 VUs  4m33.8s/6m00.0s

running (4m35.0s), 300/300 VUs, 36318 complete and 0 interrupted iterations
default   [  76% ] 300/300 VUs  4m34.8s/6m00.0s

running (4m36.0s), 300/300 VUs, 36476 complete and 0 interrupted iterations
default   [  77% ] 300/300 VUs  4m35.8s/6m00.0s

running (4m37.0s), 300/300 VUs, 36621 complete and 0 interrupted iterations
default   [  77% ] 300/300 VUs  4m36.8s/6m00.0s

running (4m38.0s), 300/300 VUs, 36752 complete and 0 interrupted iterations
default   [  77% ] 300/300 VUs  4m37.8s/6m00.0s

running (4m39.0s), 300/300 VUs, 36922 complete and 0 interrupted iterations
default   [  77% ] 300/300 VUs  4m38.8s/6m00.0s

running (4m40.0s), 300/300 VUs, 37081 complete and 0 interrupted iterations
default   [  78% ] 300/300 VUs  4m39.8s/6m00.0s

running (4m41.0s), 300/300 VUs, 37217 complete and 0 interrupted iterations
default   [  78% ] 300/300 VUs  4m40.8s/6m00.0s

running (4m42.0s), 300/300 VUs, 37376 complete and 0 interrupted iterations
default   [  78% ] 300/300 VUs  4m41.8s/6m00.0s

running (4m43.0s), 300/300 VUs, 37518 complete and 0 interrupted iterations
default   [  79% ] 300/300 VUs  4m42.8s/6m00.0s

running (4m44.0s), 300/300 VUs, 37648 complete and 0 interrupted iterations
default   [  79% ] 300/300 VUs  4m43.8s/6m00.0s

running (4m45.0s), 300/300 VUs, 37759 complete and 0 interrupted iterations
default   [  79% ] 300/300 VUs  4m44.8s/6m00.0s

running (4m46.0s), 300/300 VUs, 37860 complete and 0 interrupted iterations
default   [  79% ] 300/300 VUs  4m45.8s/6m00.0s

running (4m47.0s), 300/300 VUs, 37960 complete and 0 interrupted iterations
default   [  80% ] 300/300 VUs  4m46.8s/6m00.0s

running (4m48.0s), 300/300 VUs, 38116 complete and 0 interrupted iterations
default   [  80% ] 300/300 VUs  4m47.8s/6m00.0s

running (4m49.0s), 300/300 VUs, 38253 complete and 0 interrupted iterations
default   [  80% ] 300/300 VUs  4m48.8s/6m00.0s

running (4m50.0s), 300/300 VUs, 38406 complete and 0 interrupted iterations
default   [  80% ] 300/300 VUs  4m49.8s/6m00.0s

running (4m51.0s), 300/300 VUs, 38557 complete and 0 interrupted iterations
default   [  81% ] 300/300 VUs  4m50.8s/6m00.0s

running (4m52.0s), 300/300 VUs, 38723 complete and 0 interrupted iterations
default   [  81% ] 300/300 VUs  4m51.8s/6m00.0s

running (4m53.0s), 300/300 VUs, 38884 complete and 0 interrupted iterations
default   [  81% ] 300/300 VUs  4m52.8s/6m00.0s

running (4m54.0s), 300/300 VUs, 39028 complete and 0 interrupted iterations
default   [  82% ] 300/300 VUs  4m53.8s/6m00.0s

running (4m55.0s), 300/300 VUs, 39138 complete and 0 interrupted iterations
default   [  82% ] 300/300 VUs  4m54.8s/6m00.0s

running (4m56.0s), 300/300 VUs, 39279 complete and 0 interrupted iterations
default   [  82% ] 300/300 VUs  4m55.8s/6m00.0s

running (4m57.0s), 300/300 VUs, 39371 complete and 0 interrupted iterations
default   [  82% ] 300/300 VUs  4m56.8s/6m00.0s

running (4m58.0s), 300/300 VUs, 39494 complete and 0 interrupted iterations
default   [  83% ] 300/300 VUs  4m57.8s/6m00.0s

running (4m59.0s), 300/300 VUs, 39608 complete and 0 interrupted iterations
default   [  83% ] 300/300 VUs  4m58.8s/6m00.0s

running (5m00.0s), 300/300 VUs, 39701 complete and 0 interrupted iterations
default   [  83% ] 300/300 VUs  4m59.8s/6m00.0s

running (5m01.0s), 299/300 VUs, 39860 complete and 0 interrupted iterations
default   [  84% ] 299/300 VUs  5m00.8s/6m00.0s

running (5m02.0s), 296/300 VUs, 40002 complete and 0 interrupted iterations
default   [  84% ] 296/300 VUs  5m01.8s/6m00.0s

running (5m03.0s), 292/300 VUs, 40164 complete and 0 interrupted iterations
default   [  84% ] 292/300 VUs  5m02.8s/6m00.0s

running (5m04.0s), 290/300 VUs, 40310 complete and 0 interrupted iterations
default   [  84% ] 290/300 VUs  5m03.8s/6m00.0s

running (5m05.0s), 282/300 VUs, 40445 complete and 0 interrupted iterations
default   [  85% ] 282/300 VUs  5m04.8s/6m00.0s

running (5m06.0s), 281/300 VUs, 40591 complete and 0 interrupted iterations
default   [  85% ] 281/300 VUs  5m05.8s/6m00.0s

running (5m07.0s), 281/300 VUs, 40652 complete and 0 interrupted iterations
default   [  85% ] 281/300 VUs  5m06.8s/6m00.0s

running (5m08.0s), 279/300 VUs, 40706 complete and 0 interrupted iterations
default   [  85% ] 279/300 VUs  5m07.8s/6m00.0s

running (5m09.0s), 271/300 VUs, 40800 complete and 0 interrupted iterations
default   [  86% ] 271/300 VUs  5m08.8s/6m00.0s

running (5m10.0s), 265/300 VUs, 40906 complete and 0 interrupted iterations
default   [  86% ] 265/300 VUs  5m09.8s/6m00.0s

running (5m11.0s), 256/300 VUs, 41030 complete and 0 interrupted iterations
default   [  86% ] 256/300 VUs  5m10.8s/6m00.0s

running (5m12.0s), 247/300 VUs, 41151 complete and 0 interrupted iterations
default   [  87% ] 247/300 VUs  5m11.8s/6m00.0s

running (5m13.0s), 246/300 VUs, 41253 complete and 0 interrupted iterations
default   [  87% ] 246/300 VUs  5m12.8s/6m00.0s

running (5m14.0s), 240/300 VUs, 41403 complete and 0 interrupted iterations
default   [  87% ] 240/300 VUs  5m13.8s/6m00.0s

running (5m15.0s), 232/300 VUs, 41564 complete and 0 interrupted iterations
default   [  87% ] 232/300 VUs  5m14.8s/6m00.0s

running (5m16.0s), 225/300 VUs, 41726 complete and 0 interrupted iterations
default   [  88% ] 225/300 VUs  5m15.8s/6m00.0s

running (5m17.0s), 221/300 VUs, 41876 complete and 0 interrupted iterations
default   [  88% ] 221/300 VUs  5m16.8s/6m00.0s

running (5m18.0s), 219/300 VUs, 42025 complete and 0 interrupted iterations
default   [  88% ] 219/300 VUs  5m17.8s/6m00.0s

running (5m19.0s), 215/300 VUs, 42160 complete and 0 interrupted iterations
default   [  89% ] 215/300 VUs  5m18.8s/6m00.0s

running (5m20.0s), 210/300 VUs, 42289 complete and 0 interrupted iterations
default   [  89% ] 210/300 VUs  5m19.8s/6m00.0s

running (5m21.0s), 203/300 VUs, 42438 complete and 0 interrupted iterations
default   [  89% ] 203/300 VUs  5m20.8s/6m00.0s

running (5m22.0s), 199/300 VUs, 42568 complete and 0 interrupted iterations
default   [  89% ] 199/300 VUs  5m21.8s/6m00.0s

running (5m23.0s), 197/300 VUs, 42699 complete and 0 interrupted iterations
default   [  90% ] 197/300 VUs  5m22.8s/6m00.0s

running (5m24.0s), 189/300 VUs, 42801 complete and 0 interrupted iterations
default   [  90% ] 189/300 VUs  5m23.8s/6m00.0s

running (5m25.0s), 182/300 VUs, 42891 complete and 0 interrupted iterations
default   [  90% ] 182/300 VUs  5m24.8s/6m00.0s

running (5m26.0s), 178/300 VUs, 42964 complete and 0 interrupted iterations
default   [  90% ] 178/300 VUs  5m25.8s/6m00.0s

running (5m27.0s), 171/300 VUs, 43135 complete and 0 interrupted iterations
default   [  91% ] 171/300 VUs  5m26.8s/6m00.0s

running (5m28.0s), 164/300 VUs, 43295 complete and 0 interrupted iterations
default   [  91% ] 164/300 VUs  5m27.8s/6m00.0s

running (5m29.0s), 161/300 VUs, 43448 complete and 0 interrupted iterations
default   [  91% ] 161/300 VUs  5m28.8s/6m00.0s

running (5m30.0s), 154/300 VUs, 43601 complete and 0 interrupted iterations
default   [  92% ] 154/300 VUs  5m29.8s/6m00.0s

running (5m31.0s), 151/300 VUs, 43743 complete and 0 interrupted iterations
default   [  92% ] 151/300 VUs  5m30.8s/6m00.0s

running (5m32.0s), 146/300 VUs, 43878 complete and 0 interrupted iterations
default   [  92% ] 146/300 VUs  5m31.8s/6m00.0s

running (5m33.0s), 143/300 VUs, 44015 complete and 0 interrupted iterations
default   [  92% ] 143/300 VUs  5m32.8s/6m00.0s

running (5m34.0s), 137/300 VUs, 44165 complete and 0 interrupted iterations
default   [  93% ] 137/300 VUs  5m33.8s/6m00.0s

running (5m35.0s), 130/300 VUs, 44291 complete and 0 interrupted iterations
default   [  93% ] 130/300 VUs  5m34.8s/6m00.0s

running (5m36.0s), 128/300 VUs, 44380 complete and 0 interrupted iterations
default   [  93% ] 128/300 VUs  5m35.8s/6m00.0s

running (5m37.0s), 121/300 VUs, 44486 complete and 0 interrupted iterations
default   [  94% ] 121/300 VUs  5m36.8s/6m00.0s

running (5m38.0s), 116/300 VUs, 44583 complete and 0 interrupted iterations
default   [  94% ] 116/300 VUs  5m37.8s/6m00.0s

running (5m39.0s), 110/300 VUs, 44673 complete and 0 interrupted iterations
default   [  94% ] 110/300 VUs  5m38.8s/6m00.0s

running (5m40.0s), 104/300 VUs, 44834 complete and 0 interrupted iterations
default   [  94% ] 104/300 VUs  5m39.8s/6m00.0s

running (5m41.0s), 098/300 VUs, 44988 complete and 0 interrupted iterations
default   [  95% ] 098/300 VUs  5m40.8s/6m00.0s

running (5m42.0s), 092/300 VUs, 45140 complete and 0 interrupted iterations
default   [  95% ] 092/300 VUs  5m41.8s/6m00.0s

running (5m43.0s), 089/300 VUs, 45277 complete and 0 interrupted iterations
default   [  95% ] 089/300 VUs  5m42.8s/6m00.0s

running (5m44.0s), 083/300 VUs, 45399 complete and 0 interrupted iterations
default   [  95% ] 083/300 VUs  5m43.8s/6m00.0s

running (5m45.0s), 079/300 VUs, 45542 complete and 0 interrupted iterations
default   [  96% ] 079/300 VUs  5m44.8s/6m00.0s

running (5m46.0s), 073/300 VUs, 45676 complete and 0 interrupted iterations
default   [  96% ] 073/300 VUs  5m45.8s/6m00.0s

running (5m47.0s), 069/300 VUs, 45823 complete and 0 interrupted iterations
default   [  96% ] 069/300 VUs  5m46.8s/6m00.0s

running (5m48.0s), 065/300 VUs, 45940 complete and 0 interrupted iterations
default   [  97% ] 065/300 VUs  5m47.8s/6m00.0s

running (5m49.0s), 059/300 VUs, 46029 complete and 0 interrupted iterations
default   [  97% ] 059/300 VUs  5m48.8s/6m00.0s

running (5m50.0s), 053/300 VUs, 46137 complete and 0 interrupted iterations
default   [  97% ] 053/300 VUs  5m49.8s/6m00.0s

running (5m51.0s), 048/300 VUs, 46234 complete and 0 interrupted iterations
default   [  97% ] 048/300 VUs  5m50.8s/6m00.0s

running (5m52.0s), 042/300 VUs, 46339 complete and 0 interrupted iterations
default   [  98% ] 042/300 VUs  5m51.8s/6m00.0s

running (5m53.0s), 037/300 VUs, 46494 complete and 0 interrupted iterations
default   [  98% ] 037/300 VUs  5m52.8s/6m00.0s

running (5m54.0s), 033/300 VUs, 46637 complete and 0 interrupted iterations
default   [  98% ] 033/300 VUs  5m53.8s/6m00.0s

running (5m55.0s), 027/300 VUs, 46784 complete and 0 interrupted iterations
default   [  99% ] 027/300 VUs  5m54.8s/6m00.0s

running (5m56.0s), 022/300 VUs, 46930 complete and 0 interrupted iterations
default   [  99% ] 022/300 VUs  5m55.8s/6m00.0s

running (5m57.0s), 017/300 VUs, 47074 complete and 0 interrupted iterations
default   [  99% ] 017/300 VUs  5m56.8s/6m00.0s

running (5m58.0s), 012/300 VUs, 47192 complete and 0 interrupted iterations
default   [  99% ] 012/300 VUs  5m57.8s/6m00.0s

running (5m59.0s), 007/300 VUs, 47279 complete and 0 interrupted iterations
default   [ 100% ] 007/300 VUs  5m58.8s/6m00.0s

running (6m00.0s), 002/300 VUs, 47325 complete and 0 interrupted iterations
default   [ 100% ] 002/300 VUs  5m59.8s/6m00.0s


  █ THRESHOLDS 

    http_req_duration{name:GET /feeds/{id}}
    ✗ 'p(99)<500' p(99)=3.87s

    http_req_duration{name:GET /feeds/hot}
    ✗ 'p(99)<800' p(99)=1.74s

    http_req_duration{name:GET /feeds/scroll}
    ✗ 'p(99)<800' p(99)=3.91s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 141987  394.115795/s
    checks_succeeded...: 100.00% 141987 out of 141987
    checks_failed......: 0.00%   0 out of 141987

    ✓ scroll 200
    ✓ hot 200
    ✓ detail 200

    HTTP
    http_req_duration..............: avg=508.67ms min=11.85ms med=233.66ms max=7.67s  p(90)=1.4s     p(95)=2.16s
      { expected_response:true }...: avg=508.67ms min=11.85ms med=233.66ms max=7.67s  p(90)=1.4s     p(95)=2.16s
      { name:GET /feeds/{id} }.....: avg=594.7ms  min=31.84ms med=268.27ms max=7.19s  p(90)=1.8s     p(95)=2.53s
      { name:GET /feeds/hot }......: avg=306.81ms min=11.85ms med=153.92ms max=3.66s  p(90)=846.88ms p(95)=1.17s
      { name:GET /feeds/scroll }...: avg=624.52ms min=42.2ms  med=299.01ms max=7.67s  p(90)=1.84s    p(95)=2.58s
    http_req_failed................: 0.00%  0 out of 141989
    http_reqs......................: 141989 394.121347/s

    EXECUTION
    iteration_duration.............: avg=1.52s    min=89.03ms med=1.13s    max=11.69s p(90)=3.46s    p(95)=4.38s
    iterations.....................: 47329  131.371932/s
    vus............................: 2      min=2           max=300
    vus_max........................: 300    min=300         max=300

    NETWORK
    data_received..................: 1.6 GB 4.5 MB/s
    data_sent......................: 55 MB  151 kB/s



running (6m00.3s), 000/300 VUs, 47329 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/300 VUs  6m0s
time="2026-08-23T17:42:56+09:00" level=error msg="thresholds on metrics 'http_req_duration{name:GET /feeds/hot}, http_req_duration{name:GET /feeds/scroll}, http_req_duration{name:GET /feeds/{id}}' have been crossed"